nevinxu/HM502B2/platform/CMSIS/Include/device/MKL17Z4/MKL17Z4_pit.h
/*
 * Constants & macros for individual PIT_MCR bitfields
 */

/*!
 * @name Register PIT_MCR, field FRZ[0] (RW)
 *
 * Allows the timers to be stopped when the device enters the Debug mode.
 *
 * Values:
 * - 0 - Timers continue to run in Debug mode.
 * - 1 - Timers are stopped in Debug mode.
 */
/*@{*/
#define BP_PIT_MCR_FRZ       (0U)          /*!< Bit position for PIT_MCR_FRZ. */
#define BM_PIT_MCR_FRZ       (0x00000001U) /*!< Bit mask for PIT_MCR_FRZ. */
#define BS_PIT_MCR_FRZ       (1U)          /*!< Bit field size in bits for PIT_MCR_FRZ. */

/*! @brief Read current value of the PIT_MCR_FRZ field. */
#define BR_PIT_MCR_FRZ(x)    (BME_UBFX32(HW_PIT_MCR_ADDR(x), BP_PIT_MCR_FRZ, BS_PIT_MCR_FRZ))

/*! @brief Format value for bitfield PIT_MCR_FRZ. */
#define BF_PIT_MCR_FRZ(v)    ((uint32_t)((uint32_t)(v) << BP_PIT_MCR_FRZ) & BM_PIT_MCR_FRZ)

/*! @brief Set the FRZ field to a new value. */
#define BW_PIT_MCR_FRZ(x, v) (BME_BFI32(HW_PIT_MCR_ADDR(x), ((uint32_t)(v) << BP_PIT_MCR_FRZ), BP_PIT_MCR_FRZ, 1))
/*@}*/

/*!
 * @name Register PIT_MCR, field MDIS[1] (RW)
 *
 * Disables the standard timers. This field must be enabled before any other
 * setup is done.
 *
 * Values:
 * - 0 - Clock for standard PIT timers is enabled.
 * - 1 - Clock for standard PIT timers is disabled.
 */
/*@{*/
#define BP_PIT_MCR_MDIS      (1U)          /*!< Bit position for PIT_MCR_MDIS. */
#define BM_PIT_MCR_MDIS      (0x00000002U) /*!< Bit mask for PIT_MCR_MDIS. */
#define BS_PIT_MCR_MDIS      (1U)          /*!< Bit field size in bits for PIT_MCR_MDIS. */

/*! @brief Read current value of the PIT_MCR_MDIS field. */
#define BR_PIT_MCR_MDIS(x)   (BME_UBFX32(HW_PIT_MCR_ADDR(x), BP_PIT_MCR_MDIS, BS_PIT_MCR_MDIS))

/*! @brief Format value for bitfield PIT_MCR_MDIS. */
#define BF_PIT_MCR_MDIS(v)   ((uint32_t)((uint32_t)(v) << BP_PIT_MCR_MDIS) & BM_PIT_MCR_MDIS)

/*! @brief Set the MDIS field to a new value. */
#define BW_PIT_MCR_MDIS(x, v) (BME_BFI32(HW_PIT_MCR_ADDR(x), ((uint32_t)(v) << BP_PIT_MCR_MDIS), BP_PIT_MCR_MDIS, 1))
/*@}*/

/*******************************************************************************
 * HW_PIT_LTMR64H - PIT Upper Lifetime Timer Register
 ******************************************************************************/

/*!
 * @brief HW_PIT_LTMR64H - PIT Upper Lifetime Timer Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register is intended for applications that chain timer 0 and timer 1 to
 * build a 64-bit lifetimer. Access: User read only
 */
typedef union _hw_pit_ltmr64h
{
    uint32_t U;
    struct _hw_pit_ltmr64h_bitfields
    {
        uint32_t LTH : 32;             /*!< [31:0] Life Timer value */
    } B;
} hw_pit_ltmr64h_t;

/*!
 * @name Constants and macros for entire PIT_LTMR64H register
 */
/*@{*/
#define HW_PIT_LTMR64H_ADDR(x)   ((x) + 0xE0U)

#define HW_PIT_LTMR64H(x)        (*(__I hw_pit_ltmr64h_t *) HW_PIT_LTMR64H_ADDR(x))
#define HW_PIT_LTMR64H_RD(x)     (HW_PIT_LTMR64H(x).U)
/*@}*/

/*
 * Constants & macros for individual PIT_LTMR64H bitfields
 */

/*!
 * @name Register PIT_LTMR64H, field LTH[31:0] (RO)
 *
 * Shows the timer value of timer 1. If this register is read at a time t1,
 * LTMR64L shows the value of timer 0 at time t1.
 */
/*@{*/
#define BP_PIT_LTMR64H_LTH   (0U)          /*!< Bit position for PIT_LTMR64H_LTH. */
#define BM_PIT_LTMR64H_LTH   (0xFFFFFFFFU) /*!< Bit mask for PIT_LTMR64H_LTH. */
#define BS_PIT_LTMR64H_LTH   (32U)         /*!< Bit field size in bits for PIT_LTMR64H_LTH. */

/*! @brief Read current value of the PIT_LTMR64H_LTH field. */
#define BR_PIT_LTMR64H_LTH(x) (HW_PIT_LTMR64H(x).U)
/*@}*/

/*******************************************************************************
 * HW_PIT_LTMR64L - PIT Lower Lifetime Timer Register
 ******************************************************************************/

/*!
 * @brief HW_PIT_LTMR64L - PIT Lower Lifetime Timer Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register is intended for applications that chain timer 0 and timer 1 to
 * build a 64-bit lifetimer. To use LTMR64H and LTMR64L, timer 0 and timer 1 need
 * to be chained. To obtain the correct value, first read LTMR64H and then
 * LTMR64L. LTMR64H will have the value of CVAL1 at the time of the first access,
 * LTMR64L will have the value of CVAL0 at the time of the first access, therefore
 * the application does not need to worry about carry-over effects of the running
 * counter. Access: User read only
 */
typedef union _hw_pit_ltmr64l
{
    uint32_t U;
    struct _hw_pit_ltmr64l_bitfields
    {
        uint32_t LTL : 32;             /*!< [31:0] Life Timer value */
    } B;
} hw_pit_ltmr64l_t;

/*!
 * @name Constants and macros for entire PIT_LTMR64L register
 */
/*@{*/
#define HW_PIT_LTMR64L_ADDR(x)   ((x) + 0xE4U)

#define HW_PIT_LTMR64L(x)        (*(__I hw_pit_ltmr64l_t *) HW_PIT_LTMR64L_ADDR(x))
#define HW_PIT_LTMR64L_RD(x)     (HW_PIT_LTMR64L(x).U)
/*@}*/

/*
 * Constants & macros for individual PIT_LTMR64L bitfields
 */

/*!
 * @name Register PIT_LTMR64L, field LTL[31:0] (RO)
 *
 * Shows the value of timer 0 at the time LTMR64H was last read. It will only
 * update if LTMR64H is read.
 */
/*@{*/
#define BP_PIT_LTMR64L_LTL   (0U)          /*!< Bit position for PIT_LTMR64L_LTL. */
#define BM_PIT_LTMR64L_LTL   (0xFFFFFFFFU) /*!< Bit mask for PIT_LTMR64L_LTL. */
#define BS_PIT_LTMR64L_LTL   (32U)         /*!< Bit field size in bits for PIT_LTMR64L_LTL. */

/*! @brief Read current value of the PIT_LTMR64L_LTL field. */
#define BR_PIT_LTMR64L_LTL(x) (HW_PIT_LTMR64L(x).U)
/*@}*/

/*******************************************************************************
 * HW_PIT_LDVALn - Timer Load Value Register
 ******************************************************************************/

/*!
 * @brief HW_PIT_LDVALn - Timer Load Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers select the timeout period for the timer interrupts. Access:
 * User read/write
 */
typedef union _hw_pit_ldvaln
{
    uint32_t U;
    struct _hw_pit_ldvaln_bitfields
    {
        uint32_t TSV : 32;             /*!< [31:0] Timer Start Value */
    } B;
} hw_pit_ldvaln_t;

/*!
 * @name Constants and macros for entire PIT_LDVALn register
 */
/*@{*/
#define HW_PIT_LDVALn_COUNT (2U)

#define HW_PIT_LDVALn_ADDR(x, n) ((x) + 0x100U + (0x10U * (n)))

#define HW_PIT_LDVALn(x, n)      (*(__IO hw_pit_ldvaln_t *) HW_PIT_LDVALn_ADDR(x, n))
#define HW_PIT_LDVALn_RD(x, n)   (HW_PIT_LDVALn(x, n).U)
#define HW_PIT_LDVALn_WR(x, n, v) (HW_PIT_LDVALn(x, n).U = (v))
#define HW_PIT_LDVALn_SET(x, n, v) (BME_OR32(HW_PIT_LDVALn_ADDR(x, n), (uint32_t)(v)))
#define HW_PIT_LDVALn_CLR(x, n, v) (BME_AND32(HW_PIT_LDVALn_ADDR(x, n), (uint32_t)(~(v))))
#define HW_PIT_LDVALn_TOG(x, n, v) (BME_XOR32(HW_PIT_LDVALn_ADDR(x, n), (uint32_t)(v)))
/*@}*/

